---
kind: other
id: AllMembers.T:Autodesk.Revit.UI.IExternalCommandAvailability
source: html/30f3d4bd-c1f1-dd4c-bdc0-5325b591aed7.htm
---
# IExternalCommandAvailability Members

Implement this method to provide control over whether your external command is enabled or disabled.